import 'package:lastochki/models/entities/Name.dart';

final Name understood = Name(ru: 'Понятно', kg: 'Түшүнүктүү');
final Name notes = Name(ru: 'Заметки', kg: 'Эскертүүлөр');
final Name takeTest = Name(ru: 'Пройти тест', kg: 'Тесттен өтүү');
final Name settings = Name(ru: 'Настройки', kg: 'Баптоолор');
final Name done = Name(ru: 'Готово', kg: 'Даяр');
final Name next = Name(ru: 'Далее', kg: 'Кийинкиси');
final Name letsPlay = Name(ru: 'Играть!', kg: 'Ойноо!');
final Name noInternet = Name(
    ru: 'Мы не находим интернет. Проверь подключение и попробуй снова!',
    kg: 'Интернетке  байланыш табылган жок. Туташууну текшерип, дагы бир жолу аракет кылып көр!');
final Name tryMsg = Name(ru: 'Попробовать', kg: 'Аракет кылуу');
final Name aboutGame = Name(ru: 'Об игре', kg: 'Оюн жөнүндө');
final Name titleChapter =
    Name(ru: 'Глава @number "@title"', kg: '@number-бөлүм "@title"');
final Name numberChapter = Name(ru: 'Глава @number', kg: '@number-бөлүм');
final Name findingChapter =
    Name(ru: 'Ищем нужную главу', kg: 'Керек болгон бөлүмдү издеп жатабыз');
final Name loadingChapter =
    Name(ru: 'Загрузка главы: @percent%', kg: 'Бөлүмдү жүктөө: @percent%');
final Name tapOnScreen = Name(
    ru: 'Чтобы продолжить, нажми на экран',
    kg: 'Оюнду улантуу үчүн, экранды бас');
final Name firstChoiceTitle =
    Name(ru: 'Что ты ответишь?', kg: 'Кандай жооп бересиң?');
final Name firstChoiceContent = Name(
    ru: 'Иногда ты можешь своим решением менять ход игры. Действуй внимательно: твой выбор нельзя отменить!',
    kg: 'Кээде сен өзүңдүн чечимиң менен оюндун жүрүшүн өзгөртө аласың. Кылдат аракет кыл: сенин тандооңду артка кайтаруу мүмкүн эмес!');
final Name firstPremiumChoiceTitle =
    Name(ru: 'Оу, у тебя есть супер-ответ!', kg: 'Бали, сенде супер-жооп бар!');
final Name firstPremiumChoiceContent = Name(
    ru: 'За него нужно отдать несколько ласточек. Сколько их у тебя, показывает счётчик в правом верхнем углу. А тратить или нет – решать тебе!',
    kg: 'Ал үчүн бир нече чабалекей бериш керек. Жогорку оң бурчтагы эсептегичте, канча чабалекейиң бар экендигин көрсөн болот. Аны колдонуу же колдонбоону өзүң чечесин!');
final Name needMoreSwallowTitle = Name(
    ru: 'Ой, не хватает ласточек...',
    kg: 'Апей, чабалекейлер жетишсиз болуп жатабы...');
final Name needMoreSwallowContent = Name(
    ru: 'Их можно поймать, если пройти тест по Заметкам. Попробуешь?',
    kg: 'Эгер сен Эскертмелер боюнча тесттен өтсөң, аларды кармай аласың. Өзүңдү сынап көрөсүңбү?');
final Name chapterEnd =
    Name(ru: 'Конец главы @chapter', kg: '@chapter бөлүмдүн аягы.');
final Name chapterContinue =
    Name(ru: 'Начнём новую?', kg: 'Кийинкисине өтөлүбү?');
final Name chapterNoContinue = Name(
    ru: 'Прямо сейчас мы работаем над следующей. А пока можешь обсудить жизнь героев с другими игроками в Instagram!',
    kg: 'Азыркы учурда биз кийинки бөлүмдүн үстүнөн иштеп жатабыз. Аңгыча Instagramда каармандардын жашоосун башка оюнчулар менен талкууласан болот!');
final Name continueGame = Name(ru: 'Играть дальше', kg: 'Оюнду улантуу');
final Name replayChapter =
    Name(ru: 'Переиграть главу', kg: 'Бөлүмдү кайра ойноо');
final Name toHomePage = Name(ru: 'На Домашний экран', kg: 'Башкы экранына');
final Name gameInst = Name(ru: 'Instagram игры', kg: 'Instagram оюндары');
final Name replayChapterTitle = Name(ru: 'Обрати внимание!', kg: 'Көңүл бур!');
final Name replayChapterContent = Name(
    ru: 'Если начать главу заново, все сделанные выборы исчезнут.',
    kg: 'Эгерде бөлүмдү кайрадан башынан баштасаң, бардык тандоолор жоголот.');
final Name cancel = Name(ru: 'Отменить', kg: 'Жокко чыгаруу');
final Name share = Name(ru: 'Поделиться', kg: 'Бөлүшүү');
final Name aboutOpenline = Name(ru: 'Про Open Line', kg: 'Айкын багыт жөнүндө');
final Name writeUs = Name(ru: 'Написать нам', kg: 'Бизге кайрылуу');
final Name aboutUsTitle = Name(
    ru: 'Кто создал игру Ласточки: «Весна в Бишкеке»?',
    kg: '"Жазгы Бишкек"" Чабалекей оюнун ким жана эмне үчүн иштеп чыкты?');
final Name aboutUsContent = Name(
    ru: 'Общественный фонд «Открытая линия», который с 2009 года помогает женщинам в Кыргызстане отстаивать свои права, и команда разработчиков-активистов. Финансовую поддержку оказали фонды Sigrid Rausing Trust, «Сорос-Кыргызстан» и «ЮНИСЕФ-Кыргызстан». \nМы хотим, чтобы каждая девочка в Кыргызстане могла сама выбирать, как поступать и чем заниматься. Ведь только то, что по-настоящему тебя радует, делает жизнь счастливой. Делись игрой с друзьями и подругами!',
    kg: '2009-жылдан бери Кыргызстандагы аялдарга өз укуктарын коргоого жардам берип келе жаткан «Айкын багыт» коомдук фонду жана активисттерден турган иштеп чыгуучулар тобу. Каржылык колдоо Sigrid Rausing Trust жана ""Сорос-Кыргызстан"" фонддору жана ЮНИСЕФ тарабынан көрсөтүлдү.\nБиз Кыргызстандагы ар бир кыз өз алдынча чечим кабыл алып жана эмне менен алектенүүнү тандай билүүнүсүн каалайбыз. Чыныгы, сага жагып, кубандырган нерсе гана жашоонду бактылуу кылат. Оюнду досторуң жана курбуларың менен бөлүш!');
final Name confirmChange =
    Name(ru: 'Изменения сохранены!', kg: 'Өзгөртүүлөр сакталды!');
final Name firstNoteTitle =
    Name(ru: 'У тебя появилась Заметка!', kg: 'Сага Эскертүү келди!');
final Name firstNoteContent = Name(
    ru: 'Ты будешь собирать их в процессе игры. Зайди в специальный раздел и узнай, как они тебе пригодятся!',
    kg: 'Оюн учурунда аларды чогултасың. Атайын бөлүмгө кирип, алардын сен үчүн кандайча пайдалуу экендигин билип ал!');
final Name readNote = Name(ru: 'Прочесть', kg: 'Окуп чыгуу');
final Name backToChapter = Name(ru: 'Вернуться в главу', kg: 'Бөлүмгө кайтуу');
final Name newNoteTitle =
    Name(ru: 'Еще одна Заметка!', kg: 'Дагы бир Эскертүү алдын!');
final Name newNoteContent = Name(
    ru: 'Прочтёшь?',
    kg: 'Оюн учурунда аларды чогултасың. Атайын бөлүмгө кирип, алардын качан керектелээрин билип ал!');
final Name readNoteTitle = Name(ru: 'Отлично!', kg: 'Абдан жакшы!');
final Name readNoteContent = Name(
    ru: 'Ласточек стало больше на @swallow! Пройди тест и поймай ещё!',
    kg: 'Чабалекейлер @swallow ке көбөйдү! Тесттен өтүп дагы көбүрөөк карма!');
final Name toNotes = Name(ru: 'К Заметкам', kg: 'Эскертүүлөргө');
final Name testPassedTitle = Name(ru: 'Супер!', kg: 'Супер!');
final Name testPassedContent = Name(
    ru: 'Все ответы верные. Ласточки твои!',
    kg: 'Бардык жооптор туура. Чабалекейлерди утуп алдың!');
final Name hooray = Name(ru: 'Ура!', kg: 'Ура!');
final Name testFailedTitle =
    Name(ru: 'Почти получилось!', kg: 'Азаматсың, туура жоопко жакындадың!');
final Name testFailedContent = Name(
    ru: 'Не все ответы верные, мы заметили @mistakes ошибок в 10 ответах. \nТы можешь проверить свои ответы, или почитать Заметки и пройти тест ещё раз.',
    kg: '10 суроодон @mistakes жооп туура. \nКаерде ката кетиргениңди текшергенге мүмкүнчүлүгүң бар, Жазууларды дагы бир жолу окуп, тести кайрадан өтө аласың.');
final Name restartTest = Name(ru: 'Ещё один тест', kg: 'Дагы бир тест');
final Name checkAnswers =
    Name(ru: 'Проверить ответы', kg: 'Жоопторду текшерүү');
final Name shareText = Name(
    ru: 'Смотри, я играю в «Ласточек» – игру для девчонок. Давай со мной! Качай на Play Market ',
    kg: 'Мына, мен "Чабалекейлер" оюнун ойноп жатам - бул кыздар үчүн оюн. Кел, мени менен ойно! Play Marketтен жүктөп ал ');
final Name getInTouchTitle = Name(
    ru: 'Есть вопрос или нашлась ошибка? Напиши нам!',
    kg: 'Эгерде, сенде суроо болсо же ката тапсаң, бизге жазсаң болот!');
final Name getInTouchHintText =
    Name(ru: 'Уважаемые разработчики!', kg: 'Урматтуу иштеп чыгуучулар!');
final Name send = Name(ru: 'Отправить', kg: 'Жөнөтүү');
final Name confirmMsgTitle =
    Name(ru: 'Уже ждём твоё письмо.', kg: 'Сенин катыңды күтүп жатабыз.');
final Name confirmMsgContent = Name(ru: 'Спасибо!', kg: 'Рахмат!');
final Name restartGameTitle = Name(ru: 'Обрати внимание!', kg: '"Көңүл бур!');
final Name restartGameContent = Name(
    ru: 'Если начать игру заново, все сделанные выборы исчезнут. Игра начнётся с первой главы.',
    kg: 'Эгерде оюнду кайрадан баштасаң, бардык тандоолор жоголуп кетэт.  Оюн  кайра биринчи бөлүмдөн башталат.');
final Name restartGame = Name(ru: 'Перезапустить', kg: 'Кайрадан баштоо');
final Name noChapters = Name(
    ru: 'Новая глава будет совсем скоро!', kg: 'Жакында жаңы бөлүм башталат!');
final Name haveToReadNewNote = Name(
    ru: 'Ты уже эксперт! Найди и прочитай новые заметки, прежде чем проходить тест снова.',
    kg: 'Сен эми экспертсиң! Кайрадан тесттен өтөөрдүн алдында, жаңы эскертүүлөрдү таап, оку.');
final Name noTestTitle =
    Name(ru: 'Тест появится чуть позже', kg: 'Тест кийинчерээк пайда болот');
final Name noTestContent = Name(
    ru: 'Чтобы открыть тест, нужно собрать больше Заметок. Продолжай играть!',
    kg: 'Тестти ачуу үчүн, көбүрөөк Эскертүүлөрдү чогултуу керек. Оюнду улант!');
final Name haveUnreadNote = Name(
    ru: 'Прочитай все свои заметки, прежде чем проходить тест!',
    kg: 'Тесттен өтөөрдөн мурун, өзүңдүн бардык эскертүүлөрүңдү окуп чык!');
