import 'package:lastochki/models/entities/AnswerOption.dart';
import 'package:lastochki/models/entities/Name.dart';
import 'package:lastochki/models/entities/Note.dart';
import 'package:lastochki/models/entities/Question.dart';
import 'package:lastochki/models/entities/Test.dart';
import 'package:lastochki/services/api_client.dart';

// note example : https://astories.info/public/notes1.json
class NoteService {
  // TODO rewrite repo
  final ApiClient _repository;

  NoteService({
    ApiClient repository,
  }) : _repository = repository;

  List<Note> notes;
  List<Question> _questionBase = [];
  int _numberOfNewQuestions = 0;
  int _numberOfAttempt = 0;

  loadNotes() {
    // TODO realize
    notes = [
      Note(
          chapterNumber: 1,
          id: 0,
          title: Name(
              ru: 'ЧТО ТАКОЕ ЗАМЕТКИ И ЗАЧЕМ ОНИ НУЖНЫ?',
              kg: 'ЭСКЕРТҮҮ ДЕГЕН ЭМНЕ ЖАНА АЛАР ЭМНЕ ҮЧҮН КЕРЕК?'),
          swallow: 0,
          text: Name(
              ru: 'Твоя героиня будет попадать в самые разные ситуации: страшные, удивительные, неожиданные и по-настоящему сложные. Для того чтобы подсказывать ей правильные решения, тебе и пригодятся эти заметки.\r\n \r\nКуда идти за помощью в трудной ситуации?\r\n \r\nКак строить отношения с парнями?\r\n \r\nКак решать конфликты с близкими, чтобы никого не обидеть?\r\n \r\nИнформацию для заметок собирали психологи, юристы и журналисты Кыргызстана. Этими советами ты можешь пользоваться не только в игре, но и в жизни.\r\n \r\n<b> А ЧТО ЭТО ЗА ЛАСТОЧКИ?</b>\r\n \r\nЗа каждую прочитанную заметку ты получишь награду — ласточек. Ласточки нужны, чтобы открывать новые главы истории и выбирать самые прикольные варианты сюжета.\r\n \r\nКогда у героини появится новая заметка, ты увидишь красный значок на иконке в виде блокнота. Ты можешь прочитать заметку сразу же, как только нашла, или вернуться к ней позже, когда доиграешь главу.\r\n \r\nКогда ты найдёшь и прочитаешь несколько заметок, можно будет пройти тест и получить в награду ещё больше ласточек.\r\n \r\nА сейчас пора возвращаться в игру. \r\n \r\n Жди уведомление о новой заметке! ;)\r\n \r\n  ',
              kg: 'Сенин каарманың ар кандай коркунучтуу, кызыктуу, таң калычтуу жана чындап эле кыйын кырдаалдарга туш болот. Ага туура чечимдерди кабыл алууга жардам берүү үчүн сага ушул эскертүүлөр керек.\r\n\r\nКыйын кырдаалда кайдан жардам суроо керек?\r\n\r\nЖигиттер менен кантип мамиле түзүү керек?\r\n\r\nЖакындарың менен болгон уруш-талашты аларды капа кылбастан кантип чечүү керек?\r\n\r\nЭскертүүлөр үчүн бардык маалыматты Кыргызстандын психологдору, юристтери жана журналисттери чогултушту. Ошондуктан, бул кеңештерди оюнда гана эмес, өзүңдүн жашооңдо да колдонсон болот.\r\n\r\n<b> БУЛ ЭМНЕ БОЛГОН ЧАБАЛЕКЕЙЛЕР?</b> \r\n\r\nАр бир окуган эскертүү үчүн сен чабалекей түрүндө белек аласын. Чабалекейлер,  окуянын жаңы бөлүмдөрүн ачуу жана сюжеттеги эң кызыктуу варианттарды тандоо үчүн керек.\r\n\r\nКаарманда жаңы эскертүү пайда болгондо, блокнот түрүндө иконкада кызыл белгини көрөсүң. Эскертүүлөрдү тапканда дароо эле окуй аласың же бөлүмдү аягына чейин ойноп, анан эскертүүгө кайрылып келүүгө болот.\r\n \r\nБир нече эскертүүлөрдү таап, окугандан кийин, тесттен өтүп, белекке андан да көп чабалекей ала аласың.\r\n\r\nЭми болсо кайрадан оюнга киришели.\r\n\r\nЖаңы эскертүү жөнүндө билдирүүнү күтүп тур ;)\r\n')),
      Note(
          chapterNumber: 1,
          id: 1,
          title: Name(
              ru: 'КУДА ЗВОНИТЬ, ЕСЛИ ТЫ ИЛИ БЛИЗКИЕ ПОПАЛИ В БЕДУ',
              kg: 'ЭГЕРДЕ СЕН ЖЕ СЕНИН ЖАКЫНДАРЫҢ ООР КЫРДААЛГА ТУШ БОЛСО, КАЙДА ЧАЛУУ КЕРЕК'),
          swallow: 2,
          text: Name(
              ru: 'Запиши в свой мобильный или запомни <b>номер 112</b>. По нему можно звонить, если ты или кто-то рядом попал в беду.\r\n\r\n<b>112 — что это?</b>  \r\n\r\nЭто номер <b>единой системы вызова экстренных служб</b> в Кыргызстане. Оператор выслушает тебя и свяжет с пожарными, милицией, скорой или другими службами спасения.\r\n\r\nЗвонить можно и с городского телефона, и с мобильного. Звонок всегда бесплатный.\r\n\r\n<b>Когда звонить?</b>\r\n\r\n● В любой опасной ситуации. Звони, даже если сомневаешься, что это нужно. Проверять опасения граждан — часть работы спасателей.\r\n● Не рассчитывай, что кто-то позвонит вместо тебя. Не беда, если оператор получит несколько вызовов по одному и тому же поводу.\r\n\r\n<b>Что говорить?</b>\r\n\r\n● Представься и расскажи, что и когда произошло.\r\n● Как можно более точно опиши, где находишься.\r\n● Сообщи информацию о пострадавших: их количество, пол и возраст.\r\n● Не вешай трубку, пока оператор будет задавать тебе вопросы.\r\n● Не вешай трубку, если оператор скажет «ждите» или «оставайтесь на линии».\r\n\r\n<b>Чего не надо делать?</b>\r\n\r\n● Не звони ради шутки и праздного интереса. Возможно, кому-то в это время действительно нужна помощь, а оператор занят твоим звонком.\r\n● Не бросай трубку, если помощь больше не требуется. Дождись ответа оператора и кратко поясни, что все в порядке.\r\n● Не звони, если не нужна экстренная помощь. Лающая собака или брошенная посреди дороги машина — неприятно, но не повод для вызова спасателей.\r\n\r\n<i>Ничего не бойся и береги себя!</i>\r\n\r\n',
              kg: '<b>112 номерин</b> yюлдук телефонуңа жазып же эстеп ал. Эгерде сен же  башка бирөө оор кырдаалга туш болуп калса, ушул номер аркылуу чалса болот.\r\n\r\n<b>112 — бул эмне?</b>  \r\n\r\nБул номер <b> Кыргызстандагы </b> бирдиктүү тез жардам чакыруу тутуму. Оператор сени угуп, өртөчүрүүчү, милиция, тез жардам же башка куткаруучу кызматтар менен байланыштырат. \r\n\r\nАга стационардык же уюлдук телефондон аркылуу чалса болот. Чалуу ар дайым акысыз.\r\n\r\n<b>Кайсы учурда чалуу керек?</b>\r\n\r\n ● Ар бир коопту кырдаалда. Зарыл болгонуна күмөн санасаң дагы чал. Жарандардын кооптонуусун текшерүү- куткаруучулардын ишинин бир бөлүгү.\r\n ● Сенин ордуңа башка бирөө чалат деп ишенбе. Оператор бир эле учурда бир көйгөй боюнча бир нече чалууларды кабыл алса, эч нерсе эмес. \r\n\r\n<b>Эмнени айтуу керек?</b>\r\n\r\n ● Өзүңдү тааныштырып, эмне болгонун жана качан болгонун айтып бер.\r\n ● Кайсы жерде экениңди мүмкүн болушунча так айтып бер.\r\n ● Жабыркагандардын саны,  жынысы жана курагы боюнча толук маалымат бер\r\n ● Оператор суроолорду берип жатканда, телефонду коюп салба.\r\n ● Эгерде оператор «күтүп туруңуз» же «линияда болуп туруңуз» десе, телефонду коюп салба.\r\n\r\n<b>Эмне кылбоо керек?</b>\r\n\r\n ● Көңүл ачып же тамашалаш үчүн телефон чалба. Балким, ошол учурда кимдир бирөө жардамга өтө муктаждыр, ал эми оператор болсо сенин чалууң менен алек.\r\n ● Эгер жардам талап кылынбаса, телефонду коюп салба. Оператордун жообун күт жана бардыгы өз жайында экендигин кыскача түшүндүр.\r\n ● Эгер сага ыкчам жардам керек болбосо, чалба. Иттин үргөнү же жолдун ортосунда турган машина — сага жакпаса да, бул нерселер куткаруучуларды чакырууга негиз эмес.\r\n\r\n<i>Эч нерседен коркпо жана өзүңдү кара!</i>\r\n'),
          questions: [
            Question(
              title: Name(
                  ru: 'Работает ли в Кыргызстане единая служба спасения?',
                  kg: 'Кыргызстанда бирдиктүү куткаруу кызматы иштейби?'),
              answers: [
                AnswerOption(
                    title: Name(
                        ru: "Может и работает, но всё равно не дозвонишься.",
                        kg: "Ал иштеши мүмкүн, бирок сен бары бир чалып, ала албайсың."),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "Работала до 2017 года, сейчас нет.",
                        kg: "2017-жылга чеийн иштеген, азыр иштебейт."),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "Работает по номеру «112», все это знают!",
                        kg: "«112» номери боюнча иштейт, аны баары эле билет!"),
                    isRight: true),
              ],
            ),
            Question(
              title: Name(
                  ru: 'Ты стала свидетелем автокатастрофы. Водитель машины ранен, машина горит. Кому ты позвонишь первым?',
                  kg: 'Сен автокырсыктын күбөсү катары,  жабыркаган айдоочуну жана күйүп жаткан машинаны көрдүң.  Кимге чаласың?'),
              answers: [
                AnswerOption(
                    title: Name(
                        ru: "В скорую, чтобы спасли человека.",
                        kg: "Адамды куткаруу үчүн  тез жардамга чалам."),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "Пожарным! Надо потушить машину, а то как рванёт!",
                        kg: "Өрт өчүрүүчүлөргө! Машинаны өчүрүү керек, болбосо ал  жарылып кетет!"),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "В единую службу «112», они там сами разберутся.",
                        kg: "«112» бирдиктүү кызматына, ал жакта өздөрү талдап алышат."),
                    isRight: true),
              ],
            ),
            Question(
              title: Name(
                  ru: 'В какой ситуации оператор службы спасения решит, что ты напрасно занимаешь линию?',
                  kg: 'Куткаруу кызматынын оператору кайсы учурда, сен жөн гана убакытты алып жатканыңды түшүнөт?'),
              answers: [
                AnswerOption(
                    title: Name(
                        ru: "Я чувствую слабый запах дыма в подъезде, но это наверное просто каша пригорела у соседей.",
                        kg: "Кире бериште түтүн жыттанып турат, бирок бул жөн эле коңшулардын боткосунун күйүк жыты болсо керек."),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "Маршрутка сломалась, я опаздываю на свидание с офигенным парнем!!!",
                        kg: "Маршрутка бузулуп калды, мен крутой бир жигит менен жолугууга кечигип жатам!!!"),
                    isRight: true),
                AnswerOption(
                    title: Name(
                        ru: "Я застряла в лифте, а кнопка вызова лифтёра залеплена окаменелой жвачкой.",
                        kg: "Лифтте камалып калдым, лифттин жардамга чакыруу баскычына сагыз жабышып калыптыр."),
                    isRight: false),
              ],
            ),
            Question(
              title: Name(
                  ru: 'Работает ли в Кыргызстане единая служба спасения?',
                  kg: 'Кыргызстанда бирдиктүү куткаруу кызматы иштейби?'),
              answers: [
                AnswerOption(
                    title: Name(
                        ru: "Может и работает, но всё равно не дозвонишься.",
                        kg: "Ал иштеши мүмкүн, бирок сен бары бир чалып, ала албайсың."),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "Работала до 2017 года, сейчас нет.",
                        kg: "2017-жылга чеийн иштеген, азыр иштебейт."),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "Работает по номеру «112», все это знают!",
                        kg: "«112» номери боюнча иштейт, аны баары эле билет!"),
                    isRight: true),
              ],
            ),
            Question(
              title: Name(
                  ru: 'Ты стала свидетелем автокатастрофы. Водитель машины ранен, машина горит. Кому ты позвонишь первым?',
                  kg: 'Сен автокырсыктын күбөсү катары,  жабыркаган айдоочуну жана күйүп жаткан машинаны көрдүң.  Кимге чаласың?'),
              answers: [
                AnswerOption(
                    title: Name(
                        ru: "В скорую, чтобы спасли человека.",
                        kg: "Адамды куткаруу үчүн  тез жардамга чалам."),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "Пожарным! Надо потушить машину, а то как рванёт!",
                        kg: "Өрт өчүрүүчүлөргө! Машинаны өчүрүү керек, болбосо ал  жарылып кетет!"),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "В единую службу «112», они там сами разберутся.",
                        kg: "«112» бирдиктүү кызматына, ал жакта өздөрү талдап алышат."),
                    isRight: true),
              ],
            ),
            Question(
              title: Name(
                  ru: 'В какой ситуации оператор службы спасения решит, что ты напрасно занимаешь линию?',
                  kg: 'Куткаруу кызматынын оператору кайсы учурда, сен жөн гана убакытты алып жатканыңды түшүнөт?'),
              answers: [
                AnswerOption(
                    title: Name(
                        ru: "Я чувствую слабый запах дыма в подъезде, но это наверное просто каша пригорела у соседей.",
                        kg: "Кире бериште түтүн жыттанып турат, бирок бул жөн эле коңшулардын боткосунун күйүк жыты болсо керек."),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "Маршрутка сломалась, я опаздываю на свидание с офигенным парнем!!!",
                        kg: "Маршрутка бузулуп калды, мен крутой бир жигит менен жолугууга кечигип жатам!!!"),
                    isRight: true),
                AnswerOption(
                    title: Name(
                        ru: "Я застряла в лифте, а кнопка вызова лифтёра залеплена окаменелой жвачкой.",
                        kg: "Лифтте камалып калдым, лифттин жардамга чакыруу баскычына сагыз жабышып калыптыр."),
                    isRight: false),
              ],
            ),
            Question(
              title: Name(
                  ru: 'Работает ли в Кыргызстане единая служба спасения?',
                  kg: 'Кыргызстанда бирдиктүү куткаруу кызматы иштейби?'),
              answers: [
                AnswerOption(
                    title: Name(
                        ru: "Может и работает, но всё равно не дозвонишься.",
                        kg: "Ал иштеши мүмкүн, бирок сен бары бир чалып, ала албайсың."),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "Работала до 2017 года, сейчас нет.",
                        kg: "2017-жылга чеийн иштеген, азыр иштебейт."),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "Работает по номеру «112», все это знают!",
                        kg: "«112» номери боюнча иштейт, аны баары эле билет!"),
                    isRight: true),
              ],
            ),
            Question(
              title: Name(
                  ru: 'Ты стала свидетелем автокатастрофы. Водитель машины ранен, машина горит. Кому ты позвонишь первым?',
                  kg: 'Сен автокырсыктын күбөсү катары,  жабыркаган айдоочуну жана күйүп жаткан машинаны көрдүң.  Кимге чаласың?'),
              answers: [
                AnswerOption(
                    title: Name(
                        ru: "В скорую, чтобы спасли человека.",
                        kg: "Адамды куткаруу үчүн  тез жардамга чалам."),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "Пожарным! Надо потушить машину, а то как рванёт!",
                        kg: "Өрт өчүрүүчүлөргө! Машинаны өчүрүү керек, болбосо ал  жарылып кетет!"),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "В единую службу «112», они там сами разберутся.",
                        kg: "«112» бирдиктүү кызматына, ал жакта өздөрү талдап алышат."),
                    isRight: true),
              ],
            ),
            Question(
              title: Name(
                  ru: 'В какой ситуации оператор службы спасения решит, что ты напрасно занимаешь линию?',
                  kg: 'Куткаруу кызматынын оператору кайсы учурда, сен жөн гана убакытты алып жатканыңды түшүнөт?'),
              answers: [
                AnswerOption(
                    title: Name(
                        ru: "Я чувствую слабый запах дыма в подъезде, но это наверное просто каша пригорела у соседей.",
                        kg: "Кире бериште түтүн жыттанып турат, бирок бул жөн эле коңшулардын боткосунун күйүк жыты болсо керек."),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "Маршрутка сломалась, я опаздываю на свидание с офигенным парнем!!!",
                        kg: "Маршрутка бузулуп калды, мен крутой бир жигит менен жолугууга кечигип жатам!!!"),
                    isRight: true),
                AnswerOption(
                    title: Name(
                        ru: "Я застряла в лифте, а кнопка вызова лифтёра залеплена окаменелой жвачкой.",
                        kg: "Лифтте камалып калдым, лифттин жардамга чакыруу баскычына сагыз жабышып калыптыр."),
                    isRight: false),
              ],
            ),
            Question(
              title: Name(
                  ru: 'Работает ли в Кыргызстане единая служба спасения?',
                  kg: 'Кыргызстанда бирдиктүү куткаруу кызматы иштейби?'),
              answers: [
                AnswerOption(
                    title: Name(
                        ru: "Может и работает, но всё равно не дозвонишься.",
                        kg: "Ал иштеши мүмкүн, бирок сен бары бир чалып, ала албайсың."),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "Работала до 2017 года, сейчас нет.",
                        kg: "2017-жылга чеийн иштеген, азыр иштебейт."),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "Работает по номеру «112», все это знают!",
                        kg: "«112» номери боюнча иштейт, аны баары эле билет!"),
                    isRight: true),
              ],
            ),
            Question(
              title: Name(
                  ru: 'Ты стала свидетелем автокатастрофы. Водитель машины ранен, машина горит. Кому ты позвонишь первым?',
                  kg: 'Сен автокырсыктын күбөсү катары,  жабыркаган айдоочуну жана күйүп жаткан машинаны көрдүң.  Кимге чаласың?'),
              answers: [
                AnswerOption(
                    title: Name(
                        ru: "В скорую, чтобы спасли человека.",
                        kg: "Адамды куткаруу үчүн  тез жардамга чалам."),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "Пожарным! Надо потушить машину, а то как рванёт!",
                        kg: "Өрт өчүрүүчүлөргө! Машинаны өчүрүү керек, болбосо ал  жарылып кетет!"),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "В единую службу «112», они там сами разберутся.",
                        kg: "«112» бирдиктүү кызматына, ал жакта өздөрү талдап алышат."),
                    isRight: true),
              ],
            ),
            Question(
              title: Name(
                  ru: 'В какой ситуации оператор службы спасения решит, что ты напрасно занимаешь линию?',
                  kg: 'Куткаруу кызматынын оператору кайсы учурда, сен жөн гана убакытты алып жатканыңды түшүнөт?'),
              answers: [
                AnswerOption(
                    title: Name(
                        ru: "Я чувствую слабый запах дыма в подъезде, но это наверное просто каша пригорела у соседей.",
                        kg: "Кире бериште түтүн жыттанып турат, бирок бул жөн эле коңшулардын боткосунун күйүк жыты болсо керек."),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "Маршрутка сломалась, я опаздываю на свидание с офигенным парнем!!!",
                        kg: "Маршрутка бузулуп калды, мен крутой бир жигит менен жолугууга кечигип жатам!!!"),
                    isRight: true),
                AnswerOption(
                    title: Name(
                        ru: "Я застряла в лифте, а кнопка вызова лифтёра залеплена окаменелой жвачкой.",
                        kg: "Лифтте камалып калдым, лифттин жардамга чакыруу баскычына сагыз жабышып калыптыр."),
                    isRight: false),
              ],
            ),
            Question(
              title: Name(
                  ru: 'Работает ли в Кыргызстане единая служба спасения?',
                  kg: 'Кыргызстанда бирдиктүү куткаруу кызматы иштейби?'),
              answers: [
                AnswerOption(
                    title: Name(
                        ru: "Может и работает, но всё равно не дозвонишься.",
                        kg: "Ал иштеши мүмкүн, бирок сен бары бир чалып, ала албайсың."),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "Работала до 2017 года, сейчас нет.",
                        kg: "2017-жылга чеийн иштеген, азыр иштебейт."),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "Работает по номеру «112», все это знают!",
                        kg: "«112» номери боюнча иштейт, аны баары эле билет!"),
                    isRight: true),
              ],
            ),
            Question(
              title: Name(
                  ru: 'Ты стала свидетелем автокатастрофы. Водитель машины ранен, машина горит. Кому ты позвонишь первым?',
                  kg: 'Сен автокырсыктын күбөсү катары,  жабыркаган айдоочуну жана күйүп жаткан машинаны көрдүң.  Кимге чаласың?'),
              answers: [
                AnswerOption(
                    title: Name(
                        ru: "В скорую, чтобы спасли человека.",
                        kg: "Адамды куткаруу үчүн  тез жардамга чалам."),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "Пожарным! Надо потушить машину, а то как рванёт!",
                        kg: "Өрт өчүрүүчүлөргө! Машинаны өчүрүү керек, болбосо ал  жарылып кетет!"),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "В единую службу «112», они там сами разберутся.",
                        kg: "«112» бирдиктүү кызматына, ал жакта өздөрү талдап алышат."),
                    isRight: true),
              ],
            ),
            Question(
              title: Name(
                  ru: 'В какой ситуации оператор службы спасения решит, что ты напрасно занимаешь линию?',
                  kg: 'Куткаруу кызматынын оператору кайсы учурда, сен жөн гана убакытты алып жатканыңды түшүнөт?'),
              answers: [
                AnswerOption(
                    title: Name(
                        ru: "Я чувствую слабый запах дыма в подъезде, но это наверное просто каша пригорела у соседей.",
                        kg: "Кире бериште түтүн жыттанып турат, бирок бул жөн эле коңшулардын боткосунун күйүк жыты болсо керек."),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "Маршрутка сломалась, я опаздываю на свидание с офигенным парнем!!!",
                        kg: "Маршрутка бузулуп калды, мен крутой бир жигит менен жолугууга кечигип жатам!!!"),
                    isRight: true),
                AnswerOption(
                    title: Name(
                        ru: "Я застряла в лифте, а кнопка вызова лифтёра залеплена окаменелой жвачкой.",
                        kg: "Лифтте камалып калдым, лифттин жардамга чакыруу баскычына сагыз жабышып калыптыр."),
                    isRight: false),
              ],
            ),
          ]),
    ];
  }

  getNotes() {
    return notes;
  }

  bool isAllRead() {
    for (Note n in notes){
      if(n.isRead==null) return false;
    }
    return true;
  }

  bool isTestAvailable() => _questionBase.length >= 15;

  bool isAttemptLeft() => _numberOfAttempt < 3;

  void onNewNoteRead(List<Question> newQuestions) {
    _numberOfAttempt = 0;
    if (newQuestions!=null) {
      _numberOfNewQuestions += newQuestions.length;
      _questionBase.addAll(newQuestions);
    }
  }

  void onTestPassed() {
    _numberOfAttempt++;
  }

  Test getTest() {
    List<Question> testQuestion = [];
    int _numberOfOldQuestions =
        _numberOfNewQuestions >= 10 ? 0 : 10 - _numberOfNewQuestions;
    _questionBase.shuffle();
    for (Question q in _questionBase) {
      if (q.isNew && _numberOfNewQuestions != 0) {
        testQuestion.add(q);
        q.isNew = false;
        _numberOfNewQuestions--;
      }
      if (!q.isNew && _numberOfOldQuestions != 0) {
        testQuestion.add(q);
        _numberOfOldQuestions--;
      }
      if (testQuestion.length == 10) break;
    }
    return Test(questions: testQuestion);
  }
}
