import 'package:lastochki/models/entities/AnswerOption.dart';
import 'package:lastochki/models/entities/Name.dart';
import 'package:lastochki/models/entities/Note.dart';
import 'package:lastochki/models/entities/Question.dart';
import 'package:lastochki/models/entities/Test.dart';
import 'package:lastochki/services/api_client.dart';

// note example : https://astories.info/public/notes1.json
class NoteService {
  // TODO rewrite repo
  final ApiClient _repository;
  NoteService({
    ApiClient repository,
  }) : _repository = repository;

  List<Note> notes;

  loadNotes() {
    // TODO realize
    notes = [
      Note(
          chapterNumber: 1,
          id: 0,
          title: Name(
              ru: 'ЧТО ТАКОЕ ЗАМЕТКИ И ЗАЧЕМ ОНИ НУЖНЫ?',
              kg: 'ЭСКЕРТҮҮ ДЕГЕН ЭМНЕ ЖАНА АЛАР ЭМНЕ ҮЧҮН КЕРЕК?'),
          swallow: 0,
          text: Name(
              ru: 'Твоя героиня будет попадать в самые разные ситуации: страшные, удивительные, неожиданные и по-настоящему сложные. Для того чтобы подсказывать ей правильные решения, тебе и пригодятся эти заметки. Куда идти за помощью в трудной ситуации? Как строить отношения с парнями? Как решать конфликты с близкими, чтобы никого не обидеть? Информацию для заметок собирали психологи, юристы и журналисты Кыргызстана. Этими советами ты можешь пользоваться не только в игре, но и в жизни. <b> А ЧТО ЭТО ЗА ЛАСТОЧКИ?</b> За каждую прочитанную заметку ты получишь награду — ласточек. Ласточки нужны, чтобы открывать новые главы истории и выбирать самые прикольные варианты сюжета. Когда у героини появится новая заметка, ты увидишь красный значок на иконке в виде блокнота. Ты можешь прочитать заметку сразу же, как только нашла, или вернуться к ней позже, когда доиграешь главу. Когда ты найдёшь и прочитаешь несколько заметок, можно будет пройти тест и получить в награду ещё больше ласточек. А сейчас пора возвращаться в игру. Жди уведомление о новой заметке! ;) ',
              kg: 'Сенин каарманың ар кандай коркунучтуу, кызыктуу, таң калычтуу жана чындап эле кыйын кырдаалдарга туш болот. Ага туура чечимдерди кабыл алууга жардам берүү үчүн сага ушул эскертүүлөр керек. Кыйын кырдаалда кайдан жардам суроо керек? Жигиттер менен кантип мамиле түзүү керек? Жакындарың менен болгон уруш-талашты аларды капа кылбастан кантип чечүү керек? Эскертүүлөр үчүн бардык маалыматты Кыргызстандын психологдору, юристтери жана журналисттери чогултушту. Ошондуктан, бул кеңештерди оюнда гана эмес, өзүңдүн жашооңдо да колдонсон болот. <b> БУЛ ЭМНЕ БОЛГОН ЧАБАЛЕКЕЙЛЕР?</b> Ар бир окуган эскертүү үчүн сен чабалекей түрүндө белек аласын. Чабалекейлер,  окуянын жаңы бөлүмдөрүн ачуу жана сюжеттеги эң кызыктуу варианттарды тандоо үчүн керек. Каарманда жаңы эскертүү пайда болгондо, блокнот түрүндө иконкада кызыл белгини көрөсүң. Эскертүүлөрдү тапканда дароо эле окуй аласың же бөлүмдү аягына чейин ойноп, анан эскертүүгө кайрылып келүүгө болот.   Бир нече эскертүүлөрдү таап, окугандан кийин, тесттен өтүп, белекке андан да көп чабалекей ала аласың. Эми болсо кайрадан оюнга киришели. Жаңы эскертүү жөнүндө билдирүүнү күтүп тур ;) ')),
      Note(
          chapterNumber: 1,
          id: 1,
          title: Name(
              ru: 'КУДА ЗВОНИТЬ, ЕСЛИ ТЫ ИЛИ БЛИЗКИЕ ПОПАЛИ В БЕДУ',
              kg: 'ЭГЕРДЕ СЕН ЖЕ СЕНИН ЖАКЫНДАРЫҢ ООР КЫРДААЛГА ТУШ БОЛСО, КАЙДА ЧАЛУУ КЕРЕК'),
          swallow: 2,
          text: Name(
            ru: 'Запиши в свой мобильный или запомни <b>номер 112</b>. По нему можно звонить, если ты или кто-то рядом попал в беду. <b>112 — что это?</b> Это номер <b>единой системы вызова экстренных служб</b> в Кыргызстане. Оператор выслушает тебя и свяжет с пожарными, милицией, скорой или другими службами спасения. Звонить можно и с городского телефона, и с мобильного. Звонок всегда бесплатный. <b>Когда звонить?</b> ● В любой опасной ситуации. Звони, даже если сомневаешься, что это нужно. Проверять опасения граждан — часть работы спасателей. ● Не рассчитывай, что кто-то позвонит вместо тебя. Не беда, если оператор получит несколько вызовов по одному и тому же поводу. <b>Что говорить?</b> ● Представься и расскажи, что и когда произошло. ● Как можно более точно опиши, где находишься. ● Сообщи информацию о пострадавших: их количество, пол и возраст. ● Не вешай трубку, пока оператор будет задавать тебе вопросы. ● Не вешай трубку, если оператор скажет «ждите» или «оставайтесь на линии». <b>Чего не надо делать?</b> ● Не звони ради шутки и праздного интереса. Возможно, кому-то в это время действительно нужна помощь, а оператор занят твоим звонком. ● Не бросай трубку, если помощь больше не требуется. Дождись ответа оператора и кратко поясни, что все в порядке. ● Не звони, если не нужна экстренная помощь. Лающая собака или брошенная посреди дороги машина — неприятно, но не повод для вызова спасателей. <i>Ничего не бойся и береги себя!</i> ',
            kg: '<b>112 номерин</b> yюлдук телефонуңа жазып же эстеп ал. Эгерде сен же башка бирөө оор кырдаалга туш болуп калса, ушул номер аркылуу чалса болот. <b>112 — бул эмне?</b> Бул номер <b> Кыргызстандагы </b> бирдиктүү тез жардам чакыруу тутуму. Оператор сени угуп, өртөчүрүүчү, милиция, тез жардам же башка куткаруучу кызматтар менен байланыштырат. Ага стационардык же уюлдук телефондон аркылуу чалса болот. Чалуу ар дайым акысыз. <b>Кайсы учурда чалуу керек?</b> ● Ар бир коопту кырдаалда. Зарыл болгонуна күмөн санасаң дагы чал. Жарандардын кооптонуусун текшерүү- куткаруучулардын ишинин бир бөлүгү. ● Сенин ордуңа башка бирөө чалат деп ишенбе. Оператор бир эле учурда бир көйгөй боюнча бир нече чалууларды кабыл алса, эч нерсе эмес. <b>Эмнени айтуу керек?</b> ● Өзүңдү тааныштырып, эмне болгонун жана качан болгонун айтып бер. ● Кайсы жерде экениңди мүмкүн болушунча так айтып бер. ● Жабыркагандардын саны, жынысы жана курагы боюнча толук маалымат бер ● Оператор суроолорду берип жатканда, телефонду коюп салба. ● Эгерде оператор «күтүп туруңуз» же «линияда болуп туруңуз» десе, телефонду коюп салба. <b>Эмне кылбоо керек?</b> ● Көңүл ачып же тамашалаш үчүн телефон чалба. Балким, ошол учурда кимдир бирөө жардамга өтө муктаждыр, ал эми оператор болсо сенин чалууң менен алек. ● Эгер жардам талап кылынбаса, телефонду коюп салба. Оператордун жообун күт жана бардыгы өз жайында экендигин кыскача түшүндүр. ● Эгер сага ыкчам жардам керек болбосо, чалба. Иттин үргөнү же жолдун ортосунда турган машина — сага жакпаса да, бул нерселер куткаруучуларды чакырууга негиз эмес. <i>Эч нерседен коркпо жана өзүңдү кара!</i> ',
          ),
          test: Test(questions: [
            Question(
              question: Name(
                  ru: 'Работает ли в Кыргызстане единая служба спасения?',
                  kg: 'Кыргызстанда бирдиктүү куткаруу кызматы иштейби?'),
              answers: [
                AnswerOption(
                    title: Name(
                        ru: "Может и работает, но всё равно не дозвонишься.",
                        kg: "Ал иштеши мүмкүн, бирок сен бары бир чалып, ала албайсың."),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "Может и работает, но всё равно не дозвонишься.",
                        kg: "Ал иштеши мүмкүн, бирок сен бары бир чалып, ала албайсың."),
                    isRight: false),
                AnswerOption(
                    title: Name(
                        ru: "Может и работает, но всё равно не дозвонишься.",
                        kg: "Ал иштеши мүмкүн, бирок сен бары бир чалып, ала албайсың."),
                    isRight: true),
              ],
            )
          ])),
    ];
  }

  getNotes() {
    return notes;
  }
}
